final RegExp EMAIL_VALIDATION_REGEX =
    RegExp(r"^[\w-\.]+@([\w-]+\.)+[\w-]{2,4}$");

final RegExp PASSWORD_VALIDATION_REGEX = RegExp(
    r"^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{6,}$");

final RegExp NAME_VALIDATION_REGEX =
    RegExp(r"^[가-힣]{2,4}|[a-zA-Z]{2,10}\s[a-zA-Z]{2,10}$");

final String PLACEHOLDER_PFP =
    "https://t3.ftcdn.net/jpg/05/16/27/58/360_F_516275801_f3Fsp17x6HQK0xQgDQEELoTuER045SsWV.jpg";

final RegExp CONTENT_VALIDATION_REGEX =
    RegExp(r"^[가-힣]{2,50}|[a-zA-Z]{2,50}\s[a-zA-Z]{2,50}$");

const List<String> provinces = [
  '서울특별시',
  '부산광역시',
  '대구광역시',
  '인천광역시',
  '광주광역시',
  '대전광역시',
  '울산광역시',
  '세종특별자치시',
  '경기도',
  '강원도',
  '경상남도',
  '경상북도',
  '충청남도',
  '충청북도',
  '전라남도',
  '전라북도',
  '제주도',
];

const List<String> gyunggi = [
  '수원시',
  '성남시',
  '용인시',
  '안양시',
  '안산시',
  '과천시',
  '광명시',
  '광주시',
  '군포시',
  '부천시',
  '시흥시',
  '김포시',
  '안성시',
  '오산시',
  '의왕시',
  '이천시',
  '평택시',
  '하남시',
  '화성시',
  '여주시',
  '양평군',
  '고양시',
  '구리시',
  '남양주시',
  '동두천시',
  '양주시',
  '의정부시',
  '파주시',
  '포천시'
];

const List<String> gangwon = [
  '원주시',
  '춘천시',
  '강릉시',
  '동해시',
  '속초시',
  '삼척시',
  '태백시',
  '홍천군',
  '철원군',
  '횡성군',
  '평창군',
  '정선군',
  '영월군',
  '인제군',
  '고성군',
  '양양군',
  '화천군',
  '양구군'
];

const List<String> gyungnam = [
  '창원시',
  '김해시',
  '진주시',
  '양산시',
  '거제시',
  '통영시',
  '사천시',
  '밀양시',
  '함안군',
  '거창군',
  '창녕군',
  '고성군',
  '하동군',
  '합천군',
  '남해군',
  '함양군',
  '산청군',
  '의령군'
];

const List<String> gyungbuk = [
  '포항시',
  '경주시',
  '김천시',
  '안동시',
  '구미시',
  '영주시',
  '영천시',
  '상주시',
  '문경시',
  '경산시',
  '의성군',
  '청송군',
  '영양군',
  '영덕군',
  '청도군',
  '고령군',
  '성주군',
  '칠곡군',
  '예천군',
  '봉화군',
  '울진군',
  '울릉군'
];

const List<String> choongnam = [
  '천안시',
  '공주시',
  '보령시',
  '아산시',
  '서산시',
  '논산시',
  '계룡시',
  '당진시',
  '금산군',
  '부여군',
  '서천군',
  '청양군',
  '홍성군',
  '예산군',
  '태안군'
];

const List<String> choongbuk = [
  '청주시',
  '충주시',
  '제천시',
  '보은군',
  '옥천군',
  '영동군',
  '증평군',
  '진천군',
  '괴산군',
  '음성군',
  '단양군'
];

const List<String> geonnam = [
  '목포시',
  '여수시',
  '순천시',
  '나주시',
  '광양시',
  '담양군',
  '곡성군',
  '구례군',
  '고흥군',
  '보성군',
  '화순군',
  '장흥군',
  '강진군',
  '해남군',
  '영암군',
  '무안군',
  '함평군',
  '영광군',
  '장성군',
  '완도군',
  '진도군',
  '신안군'
];

const List<String> geonbuk = [
  '전주시',
  '익산시',
  '군산시',
  '정읍시',
  '김제시',
  '남원시',
  '완주군',
  '고창군',
  '부안군',
  '임실군',
  '순창군',
  '진안군',
  '무주군',
  '장수군'
];

const List<String> jeju = ['제주시', '서귀포시'];

const List<String> seoul = [
  '종로구',
  '중구',
  '용산구',
  '성동구',
  '광진구',
  '동대문구',
  '중랑구',
  '성북구',
  '강북구',
  '도봉구',
  '노원구',
  '은평구',
  '서대문구',
  '마포구',
  '양천구',
  '강서구',
  '구로구',
  '금천구',
  '영등포구',
  '동작구',
  '관악구',
  '서초구',
  '강남구',
  '송파구',
  '강동구'
];

const List<String> busan = [
  '중구',
  '서구',
  '동구',
  '영도구',
  '부산진구',
  '동래구',
  '남구',
  '북구',
  '해운대구',
  '사하구',
  '금정구',
  '강서구',
  '연제구',
  '수영구',
  '사상구',
  '기장군'
];

const List<String> daegu = [
  '중구',
  '서구',
  '동구',
  '남구',
  '북구',
  '수성구',
  '달서구',
  '달성군',
  '군위군',
];

const List<String> incheon = [
  '중구',
  '동구',
  '미추홀구',
  '연수구',
  '남동구',
  '부평구',
  '계양구',
  '서구',
  '강화군',
  '옹진군',
];
const List<String> gwangju = [
  '북구',
  '동구',
  '서구',
  '남구',
  '광산구',
];
const List<String> daegeon = [
  '중구',
  '동구',
  '서구',
  '유성구',
  '대덕구',
];
const List<String> ulsan = [
  '중구',
  '남구',
  '동구',
  '북구',
  '울주군',
];

const List<String> nothingToSelect = [
  '선택할 시/구가 없습니다.',
];
